Reports/ГрафикЗамеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>ГрафикЗамеров</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/Замер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Замер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГрафикЗамеров</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗамера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замерщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Километраж</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСпецификаций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаПришел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ГрафикЗамеров/Ext/ManagerModule.bsl
Функция СформироватьОтчет(ПараметрыОтчета) Экспорт
	
	Макет 				= Отчеты.ГрафикЗамеров.ПолучитьМакет("ГрафикЗамера");
	ДатаНачала 		= ПараметрыОтчета.Период.ДатаНачала;
	ДатаОкончания 	= ПараметрыОтчета.Период.ДатаОкончания;
	Замерщик 			= ПараметрыОтчета.Замерщик;
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументЗамер.АдресЗамера КАК Адрес,
	|	ДокументЗамер.ИмяЗаказчика КАК Имя,
	|	ДокументЗамер.Телефон,
	|	ДокументЗамер.Дата КАК Дата,
	|	ЧАС(ДокументЗамер.Дата) КАК ВремяЗамера,
	|	ЧАС(ДокументЗамер.Дата) + 1 КАК ВремяЗамераПлюсОдин,
	|	ДокументЗамер.Офис КАК Офис,
	|	ДокументЗамер.Замерщик КАК Замерщик,
	|	ДокументЗамер.Комментарий КАК Комментарий,
	|	ДокументЗамер.Автор КАК Дизайнер
	|ИЗ
	|	Документ.Замер КАК ДокументЗамер
	|ГДЕ
	|	ДокументЗамер.Проведен
	|	И ДокументЗамер.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДокументЗамер.Замерщик = &Замерщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Если НЕ ЗначениеЗаполнено(Замерщик) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДокументЗамер.Замерщик = &Замерщик", "");
		
	КонецЕсли;
	
	Запрос.Параметры.Вставить("НачалоПериода", ДатаНачала);
	Запрос.Параметры.Вставить("КонецПериода", ДатаОкончания);
	Запрос.Параметры.Вставить("Замерщик", Замерщик);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шапка 									= Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ПериодСтр 	= ПредставлениеПериода(ДатаНачала, ДатаОкончания);
	Строка 									= Макет.ПолучитьОбласть("Строка");
	ПустаяСтрока 						= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ТабДок 									= Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб 				= Истина;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 						= Ложь;
	ТабДок.ТолькоПросмотр 			= Ложь;
	
	ТабДок.Вывести(Шапка);
	
	НомерСтроки 		= 5;
	НачалоТекДата 	= 5;
	ТекДата 			= '0001.01.01';
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекДата) Тогда
			
			ТекДата = НачалоДня(Выборка.Дата) ;
			
		КонецЕсли;
		
		НомерСтроки = 1 + НомерСтроки;
		
		Если НачалоДня(ТекДата) <> НачалоДня(Выборка.Дата) Тогда
			
			ТабДок.Вывести(ПустаяСтрока);
			ТабДок.Вывести(ПустаяСтрока);
			
			НомерСтроки 	= 2 + НомерСтроки;
			Область 		= ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 2, 1);
			
			Область.Объединить();
			
			ТекДата 			= НачалоДня(Выборка.Дата);
			НачалоТекДата 	= НомерСтроки - 1;
			
		КонецЕсли;
		
		Строка.Параметры.Заполнить(Выборка);
		Адрес 								= ПолучитьСтруктуруАдреса(Выборка.Адрес);
		Строка.Параметры.Подъезд 	= Адрес.Подъезд;
		Строка.Параметры.Этаж 		= Адрес.Этаж;
		Строка.Параметры.Код 		= Адрес.КодПодъезда;
		Строка.Параметры.Дата 		= Формат((Выборка.Дата), "ДФ = дд.ММ")+" "+Формат((Выборка.Дата), "ДФ = дддд");
		
		ТабДок.Вывести(Строка);
		
	КонецЦикла;
	
	ТабДок.Вывести(ПустаяСтрока);
	ТабДок.Вывести(ПустаяСтрока);
	НомерСтроки 	= 2 + НомерСтроки;
	Область 		= ТабДок.Область(НачалоТекДата, 1, НомерСтроки - 1, 1);
	
	Область.Объединить();
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьСтруктуруАдреса(Адрес) Экспорт
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		
		СтруктураАдреса = Новый Структура;
		СтруктураАдреса.Вставить("НаселенныйПункт","");
		СтруктураАдреса.Вставить("Улица","");
		СтруктураАдреса.Вставить("Дом","");
		СтруктураАдреса.Вставить("Подъезд","");
		СтруктураАдреса.Вставить("КодПодъезда","");
		СтруктураАдреса.Вставить("Этаж","");
		СтруктураАдреса.Вставить("Квартира","");
		НаселенныйПункт = "";
		МассивАдрес = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес, ", ");
		СтруктураАдреса.Вставить("НаселенныйПункт", МассивАдрес[0]);
		
		Для каждого Элемент Из МассивАдрес Цикл
			
			СтруктураАдреса.Вставить("Улица", ?( Найти(Элемент, "ул. ") > 0, СтрЗаменить(Элемент, "ул. ",""),СтруктураАдреса.Улица));
			СтруктураАдреса.Вставить("Дом", ?( Найти(Элемент, "дом. ") > 0, СтрЗаменить(Элемент, "дом. ",""),СтруктураАдреса.Дом));
			СтруктураАдреса.Вставить("Подъезд", ?( Найти(Элемент, "подъезд. ") > 0, СтрЗаменить(Элемент, "подъезд. ",""),СтруктураАдреса.Подъезд));
			СтруктураАдреса.Вставить("КодПодъезда", ?( Найти(Элемент, "код подъезда. ") > 0, СтрЗаменить(Элемент, "код подъезда. ",""),СтруктураАдреса.КодПодъезда));
			СтруктураАдреса.Вставить("Этаж", ?( Найти(Элемент, "этаж. ") > 0, СтрЗаменить(Элемент, "этаж. ",""),СтруктураАдреса.Этаж));
			СтруктураАдреса.Вставить("Квартира", ?( Найти(Элемент, "кв. ") > 0, СтрЗаменить(Элемент, "кв. ",""),СтруктураАдреса.Квартира));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураАдреса;
	
КонецФункции
